# Plane Properties

---
The Plane type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from Surface)
| Normal|  Plane normal.
| OrientationMatchesParametricOrientation|  Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation. (Inherited from Surface)
| Origin|  Plane origin.
| XVec|  Axis defining the first parametric direction of the plane.
| YVec|  Axis defining the second parametric direction of the plane.
Top
#### Reference
Plane Class
Autodesk.Revit.DB Namespace